In [3]:
import sys
sys.path.insert(0, r'C:\Users\voutilainenv\Desktop\Packages\Anaconda')
from matplotlib import pyplot as plt

In [8]:
import pandas as pd
import numpy as np
import os
from IPython.display import display_html
from IPython.display import display

def display_side_by_side(*args):
    html_str=''
    for df in args:
        html_str+=df.to_html()
    html_str = html_str.replace('table','table style="display:inline; border:0px"')          
    display_html(html_str,raw=True)

In [53]:
data = {'ID': [1, 2, 2],'Names': ['Kate', 'John', 'Max'],'Age': ['g50', 40, 25], 'Values': [3, 4, np.nan] , 'Height': [174, 181, '169']}
df = pd.DataFrame(data=data)

In [60]:
print("Length of dataframe: {}".format(len(df)))
df.head()

Length of dataframe: 3

   Age Height  ID Names  Values
0  g50    174   1  Kate     3.0
1   40    181   2  John     4.0
2   25    169   2   Max     NaN

In [55]:
display(df.columns)

Index(['Age', 'Height', 'ID', 'Names', 'Values'], dtype='object')

In [56]:
df.describe()

             ID    Values
count  3.000000  2.000000
mean   1.666667  3.500000
std    0.577350  0.707107
min    1.000000  3.000000
25%    1.500000  3.250000
50%    2.000000  3.500000
75%    2.000000  3.750000
max    2.000000  4.000000

In [57]:
colnames = df.columns
for colname in colnames:
    print('Type of column {} is {}'.format(colname,df[colname].dtype))
    print('Type of column {} values is {}'.format(colname,df[colname].values.dtype))
    print('-'*30)

Type of column Age is object
Type of column Age values is object
------------------------------
Type of column Height is object
Type of column Height values is object
------------------------------
Type of column ID is int64
Type of column ID values is int64
------------------------------
Type of column Names is object
Type of column Names values is object
------------------------------
Type of column Values is float64
Type of column Values values is float64
------------------------------

In [58]:
# Count NaNs and non-numeric field
colnames = df.columns
for colname in colnames:    
    print('Column {} has {} NaN observations'.format(colname,pd.isnull(df[colname]).sum()))
    print('Column {} has {} non-numeric observations'.format(colname, len(df.loc[pd.to_numeric(df[colname], errors='coerce').isnull(), colname])))
    print('-'*30)

Column Age has 0 NaN observations
Column Age has 1 non-numeric observations
------------------------------
Column Height has 0 NaN observations
Column Height has 0 non-numeric observations
------------------------------
Column ID has 0 NaN observations
Column ID has 0 non-numeric observations
------------------------------
Column Names has 0 NaN observations
Column Names has 3 non-numeric observations
------------------------------
Column Values has 1 NaN observations
Column Values has 1 non-numeric observations
------------------------------

### Duplicates in some column

In [37]:
counts = df['ID'].value_counts()
counts  = counts[counts >= 2].index

display(df[df['ID'].isin(counts)])
print("{} duplicate IDs".format(df.duplicated(subset=['ID'], keep='first').sum()))
orig_length = len(df)

   Age  ID Names  Values
1   40   2  John     4.0
2   25   2   Max     NaN

1 duplicate IDs

In [ ]:
# Drop observations where NaN
colnames = df_test.columns
for colname in colnames:    
    print('Dropping {} observations due to NaN in {}'.format(pd.isnull(df[colname]).sum(), colname))
    df_test = df_test[pd.isnull(df_test[colname]) == False]